export const questionList = [
  {
    id: 1,
    type: "EI",
    q: "친구에게 약속에 내 친구를 데려가도 되냐고 물었을때",
    a: [
      { type: "E", text: "좋아좋아 불러~!" },
      { type: "I", text: "엥, 불편한데?" },
    ],
  },

  {
    id: 2,
    type: "SN",
    q: "친구에게 만약에 무인도에 떨어지면 어떻게 할거야? 물었을때",
    a: [
      { type: "S", text: "무인도에 왜 떨어져? 라고 말한다." },
      { type: "N", text: "신나서 얘기한다" },
    ],
  },

  {
    id: 3,
    type: "TF",
    q: "친구에게 고민을 털어놓으면",
    a: [
      { type: "T", text: "현실적으로 해결책을 말해준다" },
      { type: "F", text: "위로와 공감을 해준다" },
    ],
  },

  {
    id: 4,
    type: "PJ",
    q: "내 친구는 약속시간에",
    a: [
      { type: "P", text: "늦을 때가 많다" },
      { type: "J", text: "절대 안 늦는다" },
    ],
  },

  {
    id: 5,
    type: "PJ",
    q: "내 친구는 즉흥적으로 약속을 잡아도",
    a: [
      { type: "P", text: "좋아하면서 나온다" },
      { type: "J", text: "쉬는 날이라며 거절한다" },
    ],
  },

  {
    id: 6,
    type: "SN",
    q: "내 친구는 쓸데 없는 선물을 주는 것을",
    a: [
      { type: "S", text: "재미있어 하며, 아이디어를 낼 것이다" },
      { type: "N", text: "쓸데 없는 선물을 왜 줘? 라고 할 것이다" },
    ],
  },

  {
    id: 7,
    type: "EI",
    q: "내 친구는 길고 고단한 한 주 끝에",
    a: [
      { type: "E", text: "친구들과 모임을 하며 스트레스를 푼다" },
      { type: "I", text: "혼자 휴식을 취한다" },
    ],
  },

  {
    id: 8,
    type: "TF",
    q: "내 친구와 슬픈 영화를 보면",
    a: [
      { type: "T", text: "슬퍼하는 친구를 신기해하고 있다" },
      { type: "F", text: "옆에서 눈물을 흘리고 있다" },
    ],
  },

  {
    id: 9,
    type: "PJ",

    q: "내 친구의 핸드폰 화면이나 주변자리는",
    a: [
      { type: "P", text: "정리되어 있지 않다" },
      { type: "J", text: "깔끔하게 정리되어 있다" },
    ],
  },

  {
    id: 10,
    type: "SN",
    q: "내 친구는 꽃 선물을 받으면",
    a: [
      { type: "S", text: "이 돈으로 다른 걸 사주지 생각할 것 같다" },
      { type: "N", text: "기뻐할 것 같다" },
    ],
  },

  {
    id: 11,
    type: "SN",
    q: "친구에게 나 오늘 로또 샀다고 말하면?",
    a: [
      { type: "S", text: "로또? 될 확률 없을텐데..." },
      { type: "N", text: "헐 대박 로또 당첨되면 뭐 할거야?" },
    ],
  },

  {
    id: 12,
    type: "PJ",
    q: "내 친구는 반복적인 업무를",
    a: [
      { type: "P", text: "지루해한다" },
      { type: "J", text: "편안해 한다" },
    ],
  },
];
